nxp-mcuxpresso/mcux-sdk-examples/mimxrt700evk/demo_apps/power_mode_with_hifi/cm33_core1/power_mode_with_hifi.c
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_debug_console.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "board.h"
#include "fsl_common.h"
#include "fsl_power.h"
#include "pmic_support.h"
#include "power_demo_config.h"
#include "fsl_lpuart.h"
#include "fsl_gpio.h"
#include "fsl_irtc.h"
#include "fsl_iopctl.h"

#include "fsl_mu.h"
#include "dsp_support.h"
#include "fsl_dsp.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define DEMO_NORMAL_RUN_VOLT 900000U /* The VDD1 voltage during normal run. */
#define DEMO_LOW_POWER_RUN_VOLT                                                                            \
    700000U                          /* The VDD1 voltage during low power run. Used for CPU1 DS while CPU0 \
                                        active.*/
#ifndef DEMO_POWER_CPU1_PRINT_ENABLE
#define DEMO_POWER_CPU1_PRINT_ENABLE 1U
#endif
/* Wheter HiFi1 uses LPUART for PRINTF or not */
#ifndef DEMO_POWER_HIFI1_PRINT_ENABLE
#define DEMO_POWER_HIFI1_PRINT_ENABLE 0U
#endif
#if DEMO_POWER_CPU1_PRINT_ENABLE
#define DEMO_LOG PRINTF
#else
#define DEMO_LOG(...)
#endif

#define APP_CORE_NAME "CPU1"

#define APP_USER_WAKEUP_KEY_GPIO BOARD_SW6_GPIO
#define APP_USER_WAKEUP_KEY_PIN  BOARD_SW6_GPIO_PIN
#define APP_USER_WAKEUP_KEY_NAME "SW6"
#define APP_SW_IRQ_HANDLER       GPIO80_IRQHandler
#define APP_SW_IRQN              GPIO80_IRQn
#define APP_SW_RESET_RSTn        kGPIO8_RST_SHIFT_RSTn
#define APP_SW_CLOCK_EN          kCLOCK_Gpio8
#define APP_SW_LP_REQ            kPower_GPIO8_LPREQ

#define APP_RTC             RTC1
#define APP_RTC_IRQN        RTC1_ALARM_IRQn
#define APP_RTC_IRQ_HANDLER RTC1_ALARM_IRQHandler

#define APP_USART_RX_ERROR (kLPUART_RxOverrunFlag | kLPUART_RxFifoUnderflowFlag)

/*!< Power down all unnecessary blocks and enable RBB during deep sleep. */
#define APP_DEEPSLEEP_SLEEPCFG    (0U)        /* SLEEPCON->SLEEPCFG */
#define APP_DEEPSLEEP_PDSLEEPCFG0 (0U)        /* PMC->PDSLEEPCFG0 */
#define APP_DSR_PDSLEEPCFG0       (0U)        /* PMC->PDSLEEPCFG0 */
#define APP_DEEPSLEEP_RAM_APD     0x3FFC0000U /* PMC->PDSLEEPCFG2, 0x580000 - 0x67FFFF([PT18-PT29]) keep powered */
#define APP_DEEPSLEEP_RAM_PPD     0x0U        /* PMC->PDSLEEPCFG3 */
#define APP_EXCLUDE_FROM_DEEPSLEEP                                                                     \
    (((const uint32_t[]){APP_DEEPSLEEP_SLEEPCFG, APP_DEEPSLEEP_PDSLEEPCFG0, 0U, APP_DEEPSLEEP_RAM_APD, \
                         APP_DEEPSLEEP_RAM_PPD, 0U, 0U}))
#define APP_EXCLUDE_FROM_DSR                                                                     \
    (((const uint32_t[]){APP_DEEPSLEEP_SLEEPCFG, APP_DSR_PDSLEEPCFG0, 0U, APP_DEEPSLEEP_RAM_APD, \
                         APP_DEEPSLEEP_RAM_PPD, 0U, 0U}))
#define APP_EXCLUDE_FROM_DEEP_POWERDOWN      (((const uint32_t[]){0, 0, 0, 0, 0, 0, 0}))
#define APP_EXCLUDE_FROM_FULL_DEEP_POWERDOWN (((const uint32_t[]){0, 0, 0, 0, 0, 0, 0}))
typedef enum _app_wakeup_source
{
    kAPP_WakeupSourcePin,   /*!< Wakeup by external pin. */
    kAPP_WakeupSourceRtc,   /*!< Wakeup by RTC.        */
    kAPP_WakeupSourceReset, /*!< Wakeup by Reset. */
} app_wakeup_source_t;

/*******************************************************************************
 * Variables
 ******************************************************************************/
const char *gWakeupInfoStr[] = {"Sleep", "Deep Sleep", "Deep Sleep Retention", "Deep Powerdown [Reset to wakeup]",
                                "Full Deep Powerdown [Reset to wakeup]"};
uint32_t gCurrentPowerMode;

static uint32_t s_wakeupTimeout;           /* Wakeup timeout. (Unit: seconds) */
static app_wakeup_source_t s_wakeupSource; /* Wakeup source. */

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
void BOARD_InitPowerConfig(void);
void BOARD_RunActiveTest(void);
void BOARD_RestorePeripheralsAfterDSR(void);
void BOARD_EnterSleep(void);
void BOARD_EnterDeepSleep(const uint32_t exclude_from_pd[7]);
void BOARD_RequestDSR(const uint32_t exclude_from_pd[7]);
void BOARD_RequestDPD(const uint32_t exclude_from_pd[7]);
void BOARD_RequestFDPD(const uint32_t exclude_from_pd[7]);

static uint32_t APP_GetUserSelection(void);
static void APP_InitWakeupPin(void);
/*******************************************************************************
 * Code
 ******************************************************************************/
void BOARD_RestorePeripheralsAfterDSR(void)
{
    BOARD_InitDebugConsole();
}

void BOARD_NotifyBoot(void)
{
    RESET_ClearPeripheralReset(kMU1_RST_SHIFT_RSTn);
    MU_Init(MU1_MUB);
    MU_SetFlags(MU1_MUB, BOOT_FLAG);
    MU_Deinit(MU1_MUB);
}

void BOARD_InitPowerConfig(void)
{
    /* Enable the used modules in sense side. */
    POWER_DisablePD(kPDRUNCFG_SHUT_SENSEP_MAINCLK);
    POWER_DisablePD(kPDRUNCFG_SHUT_SENSES_MAINCLK);
    POWER_DisablePD(kPDRUNCFG_GATE_FRO2);
    POWER_DisablePD(kPDRUNCFG_PD_FRO2);
    POWER_DisablePD(kPDRUNCFG_PD_LPOSC); /* Used by RTC. */

    SYSCON3->SENSE_AUTOGATE_EN = 0x3U;
    CLOCK_EnableClock(kCLOCK_Cpu1); /*Let CPU1 control it's clock. */

    /* Disable unused clock. */
    CLOCK_DisableClock(kCLOCK_Glikey1);
    CLOCK_DisableClock(kCLOCK_Glikey2);
    CLOCK_DisableClock(kCLOCK_Glikey4);
    CLOCK_DisableClock(kCLOCK_Glikey5);
    CLOCK_DisableClock(kCLOCK_SenseAccessRamArbiter0);
    CLOCK_DisableClock(kCLOCK_MediaAccessRamArbiter1);
    CLOCK_AttachClk(kNONE_to_SYSTICK);
    CLOCK_AttachClk(kNONE_to_MICFIL0);

    /* Disable unused modules. */
    POWER_EnablePD(kPDRUNCFG_SHUT_RAM0_CLK);
    POWER_EnablePD(kPDRUNCFG_SHUT_RAM1_CLK); /* Compute access RAM arbiter1 clock. */
    POWER_EnablePD(kPDRUNCFG_SHUT_COMNN_MAINCLK);
    POWER_EnablePD(kPDRUNCFG_SHUT_MEDIA_MAINCLK);
    POWER_EnablePD(kPDRUNCFG_PD_SYSXTAL);
    POWER_EnablePD(kPDRUNCFG_PD_PLLANA);
    POWER_EnablePD(kPDRUNCFG_PD_PLLLDO);
    POWER_EnablePD(kPDRUNCFG_PD_AUDPLLANA);
    POWER_EnablePD(kPDRUNCFG_PD_AUDPLLLDO);
    POWER_EnablePD(kPDRUNCFG_PD_ADC0);
    POWER_EnablePD(kPDRUNCFG_LP_DCDC);
    PMC1->PDRUNCFG1 = 0x7FFFFFFFU;
    PMC1->PDRUNCFG2 &= ~(0x3FFC0000U); /* Power up all the SRAM partitions in Sense domain. */
    PMC1->PDRUNCFG3 &= ~(0x3FFC0000U);
    POWER_EnablePD(kPDRUNCFG_PPD_OCOTP);
    POWER_ApplyPD();

    /* Request the domains out of sense into RBB mode. */
    POWER_EnableRunAFBB(kPower_BodyBiasVdd1);
    POWER_EnableRunNBB(kPower_BodyBiasVdd1Sram);
    POWER_EnableRunRBB(kPower_BodyBiasVdd2 | kPower_BodyBiasVddn | kPower_BodyBiasVdd2Sram);
    POWER_EnableSleepRBB(kPower_BodyBiasVdd2 | kPower_BodyBiasVddn | kPower_BodyBiasVdd2Sram | kPower_BodyBiasVdd1 |
                         kPower_BodyBiasVdd1Sram);
    POWER_ApplyPD();

    power_regulator_voltage_t ldo = {
        .LDO.vsel0 = 700000,  /* 0x14: 700mv, 0.45 V + 12.5 mV * x */
        .LDO.vsel1 = 800000,  /* 0x1C: 800mv*/
        .LDO.vsel2 = 900000,  /* 0x24: 900mv */
        .LDO.vsel3 = 1000000, /* 0x2C: 1000mv */
    };

    power_lvd_voltage_t lvd = {
        .VDD12.lvl0 = 500000, /* 500mv */
        .VDD12.lvl1 = 600000, /* 600mv */
        .VDD12.lvl2 = 700000, /* 700mv */
        .VDD12.lvl3 = 800000, /* 800mv */
    };

    POWER_ConfigRegulatorSetpoints(kRegulator_Vdd1LDO, &ldo, &lvd);

