nxp-mcuxpresso/mcux-sdk-examples/mimxrt700evk/demo_apps/power_mode_with_hifi/cm33_core1/power_mode_with_hifi.c
#if defined(DEMO_POWER_SUPPLY_OPTION) && (DEMO_POWER_SUPPLY_OPTION == DEMO_POWER_SUPPLY_MIXED)
    POWER_SelectRunSetpoint(kRegulator_Vdd1LDO, 2U);
    POWER_SelectSleepSetpoint(kRegulator_Vdd1LDO, 0U);
    POWER_SelectRunSetpoint(kRegulator_Vdd2LDO, 0U);
    POWER_SelectSleepSetpoint(kRegulator_Vdd2LDO, 0U);
    POWER_ApplyPD();
#elif defined(DEMO_POWER_SUPPLY_OPTION) && (DEMO_POWER_SUPPLY_OPTION == DEMO_POWER_SUPPLY_PMIC)
    POWER_DisableLPRequestMask(kPower_MaskLpi2c15);
    BOARD_InitPmic();
    /* Select the lowest LVD setpoint. */
    POWER_SelectRunSetpoint(kRegulator_Vdd2LDO, 0U);
    POWER_SelectSleepSetpoint(kRegulator_Vdd2LDO, 0U);
    POWER_SelectRunSetpoint(kRegulator_Vdd1LDO, 0U);
    POWER_SelectSleepSetpoint(kRegulator_Vdd1LDO, 0U);
    POWER_ApplyPD();

    BOARD_SetPmicVdd1Voltage(900000U);
#endif

#if (DEMO_POWER_ENABLE_DEBUG == 0U)
    CLOCK_DisableClock(kCLOCK_Dbg);
#endif
}

/* Set IO pads to default. */
void BOARD_DisableIoPads(void)
{
    uint8_t port, pin;

    RESET_ClearPeripheralReset(kIOPCTL1_RST_SHIFT_RSTn);
    CLOCK_EnableClock(kCLOCK_Iopctl1);

    port = 8;
    pin  = 5U; /* Keep JTAG pin unchanged. */

    for (; pin <= 31U; pin++)
    {
        IOPCTL_PinMuxSet(port, pin, 0U);
    }

    port = 9U;
    for (pin = 0U; pin <= 2U; pin++)
    {
        IOPCTL_PinMuxSet(port, pin, 0U);
    }

    port = 10U;
    for (pin = 0U; pin <= 17U; pin++)
    {
        IOPCTL_PinMuxSet(port, pin, 0U);
    }
}

/*!
 * @brief API to perform a dummy read to the selected SRAM partitions. SRAM auto clock gating can save power if
 * partitions are parked on the core for their domain (CPU0 for RAM arbiter0 and CPU1 for RAM
 * arbiter1). This function will perform a dummy read to the specified RAM partitions to force the clock to
 * park on that core until another master accesses each partition.
 *
 * NOTE, make sure the caller is allowed to access the given SRAM partition, otherwise the system may hang!
 *
 * @param pt SRAM Partition, 0-17 for RAM arbiter0, 18-29 for RAM arbiter1.
 *
 */
void POWER_SramDummyRead(uint32_t pt)
{
    uint32_t dummy;
    const uint32_t sram_addr[30] = {0x20000000, 0x20008000, 0x20010000, 0x20018000, 0x20020000, 0x20030000,
                                    0x20040000, 0x20060000, 0x20080000, 0x200C0000, 0x20100000, 0x20180000,
                                    0x20200000, 0x20300000, 0x20400000, 0x20480000, 0x20500000, 0x20540000,
                                    0x20580000, 0x20588000, 0x20590000, 0x20598000, 0x205A0000, 0x205B0000,
                                    0x205C0000, 0x205E0000, 0x20600000, 0x20680000, 0x20700000, 0x20740000};

    dummy = *((volatile uint32_t *)(sram_addr[pt]));
    dummy++; /* suppress warning. */
}

void BOARD_ResumeDSP(void)
{
    BOARD_DSP_Init(1U, 2U, false); /* Select FRO2_MAX divider by 2 as HIFI clock. */
}

void BOARD_StopDSP(void)
{
    uint32_t i;
    DSP_Stop();

    POWER_SramDummyRead(18U); /* DSP vector using SRAM PT18. */
    /* Dummy read the SRAM partition to let SRAM partition's clock park on CM33. */
    for (i = DEMO_HIFI1_SRAM_PT_START; i <= DEMO_HIFI1_SRAM_PT_END; i++)
    {
        POWER_SramDummyRead(i);
    }

    DSP_Deinit();
    CLOCK_AttachClk(kNONE_to_SENSE_DSP);
}


void BOARD_RunActiveTest(void)
{
    DEMO_LOG("\r\nThis test mode will keep CPU in run mode but close all other unused modules for a while.\n");
    DEMO_LOG("\r\nPlease don't input any charator until the mode finished.\n");

    /* Disable clocks - CLKCTL1(Sense private) */
    CLOCK_DisableClock(kCLOCK_Syscon1); /* CLKCTL1->PSCCTL0 */
#if (DEMO_POWER_HIFI1_USED == 0U) || (DEMO_POWER_HIFI1_PRINT_ENABLE == 0U)
    DbgConsole_Deinit();
    CLOCK_AttachClk(kNONE_to_FLEXCOMM19);
    CLKCTL1->PSCCTL1 = 0U; /* Disable clock for INPUTMUX, WWDT2-3, MU3, SEMA42_3, UTICK1, MRT1, CTIMER5-7, PINT, GPIO,
                              FLEXCOMM, eDMA, HiFI1, SenseAccessRAM0. */
    CLOCK_EnableFroClkOutput(FRO2, kCLOCK_FroDiv1OutEn);
#else
    CLKCTL1->PSCCTL1 = CLKCTL1_PSCCTL1_HIFI1_MASK | CLKCTL1_PSCCTL1_CLR_LP_FLEXCOMM19_MASK;
    CLOCK_EnableFroClkOutput(FRO2,
                             kCLOCK_FroDiv1OutEn | kCLOCK_FroDiv3OutEn); /* LPUART19 uses SENSE BASE run on FRO2_DIV3 */
#endif

    /* Disable clocks - CLKCTL3(Sense shared) */
    CLOCK_DisableClock(kCLOCK_Mu1);
    CLOCK_DisableClock(kCLOCK_Iopctl1);
    CLOCK_DisableClock(kCLOCK_Syscon3);
    CLOCK_DisableClock(kCLOCK_Sema420);
    CLOCK_DisableClock(kCLOCK_LPI2c15);
    CLOCK_DisableClock(kCLOCK_Rtc);

    /* Disable clock slice. */
    CLOCK_AttachClk(kNONE_to_LPI2C15);

    POWER_EnablePD(kPDRUNCFG_APD_OCOTP);
    /* Note, the debug will not work anymore when the sense shared mainclk is disabled. */
    POWER_EnablePD(kPDRUNCFG_PD_LPOSC);
    POWER_EnablePD(kPDRUNCFG_SHUT_SENSES_MAINCLK);
    POWER_ApplyPD();
    CLOCK_DisableClock(kCLOCK_Sleepcon1);

    /* Simulate a task. */
    uint32_t i;
    for (i = 0U; i < 500U; i++)
    {
        SDK_DelayAtLeastUs(10000U, CLOCK_GetCoreSysClkFreq());
    }

    CLOCK_EnableClock(kCLOCK_Sleepcon1);
    CLOCK_EnableClock(kCLOCK_Syscon1); /* CLKCTL1->PSCCTL0 */
    CLOCK_EnableClock(kCLOCK_Iopctl1);
    POWER_DisablePD(kPDRUNCFG_PD_LPOSC);
    POWER_DisablePD(kPDRUNCFG_SHUT_SENSES_MAINCLK);
    CLOCK_EnableFroClkOutput(FRO2, kCLOCK_FroDiv1OutEn | kCLOCK_FroDiv3OutEn | kCLOCK_FroDiv6OutEn);
    POWER_DisablePD(kPDRUNCFG_APD_OCOTP);
    POWER_ApplyPD();

    CLOCK_AttachClk(kSENSE_BASE_to_LPI2C15);

    /* Enable clocks - CLKCTL3(Sense shared) */
    CLOCK_EnableClock(kCLOCK_Mu1);
    CLOCK_EnableClock(kCLOCK_Syscon3);
    CLOCK_EnableClock(kCLOCK_Sema420);
    CLOCK_EnableClock(kCLOCK_LPI2c15);
#if (DEMO_POWER_HIFI1_USED == 0U) || (DEMO_POWER_HIFI1_PRINT_ENABLE == 0U)
    BOARD_InitDebugConsole();
#endif
}

void BOARD_EnterSleep(void)
{
    uint32_t irqMask;
    /* Disable clock for unused modules. */
#if (DEMO_POWER_HIFI1_USED == 0U) || (DEMO_POWER_HIFI1_PRINT_ENABLE == 0U)
    DbgConsole_Deinit();
#endif
    CLOCK_DisableClock(kCLOCK_Syscon1);
    CLOCK_DisableClock(kCLOCK_Iopctl1);
    CLOCK_DisableClock(kCLOCK_Mu1);
    CLOCK_DisableClock(kCLOCK_Syscon3);
    CLOCK_DisableClock(kCLOCK_Sema420);
    CLOCK_DisableClock(kCLOCK_LPI2c15);
#if (DEMO_POWER_HIFI1_USED == 0U) || (DEMO_POWER_HIFI1_PRINT_ENABLE == 0U)
    CLOCK_AttachClk(kLPOSC_to_SENSE_BASE); /* To disable FRO2 DIV3, switch sense base to LPOSC. */
    CLOCK_EnableFroClkOutput(FRO2, kCLOCK_FroDiv1OutEn);

    irqMask = DisableGlobalIRQ();

    /* POWER_EnablePD(kPDRUNCFG_PD_LPOSC); */
    POWER_EnablePD(kPDRUNCFG_SHUT_SENSES_MAINCLK);

    /* Optional: switch CPU clock to 1M LPOSC for lower power consumption. */
    CLOCK_AttachClk(kLPOSC_to_SENSE_BASE);
    CLOCK_AttachClk(kSENSE_BASE_to_SENSE_MAIN);
    CLOCK_SetClkDiv(kCLOCK_DivSenseMainClk, 1U);

