nxp-mcuxpresso/mcux-sdk-examples/mimxrt700evk/demo_apps/power_mode_with_hifi/cm33_core1/power_mode_with_hifi.c
    POWER_EnterSleep();

    /* Restore CPU clock. */
    CLOCK_SetClkDiv(kCLOCK_DivSenseMainClk, 2U);
    CLOCK_AttachClk(kFRO2_DIV1_to_SENSE_MAIN);
    CLOCK_AttachClk(kFRO2_DIV3_to_SENSE_BASE);

    /* POWER_DisablePD(kPDRUNCFG_PD_LPOSC); */
    POWER_DisablePD(kPDRUNCFG_SHUT_SENSES_MAINCLK);
#else
    CLOCK_EnableFroClkOutput(FRO2,
                             kCLOCK_FroDiv1OutEn | kCLOCK_FroDiv3OutEn); /* LPUART uses FRO2_DIV3(sense base clock). */

    irqMask = DisableGlobalIRQ();

    POWER_EnablePD(kPDRUNCFG_PD_LPOSC);
    POWER_EnablePD(kPDRUNCFG_SHUT_SENSES_MAINCLK);

    POWER_EnterSleep();

    POWER_DisablePD(kPDRUNCFG_PD_LPOSC);
    POWER_DisablePD(kPDRUNCFG_SHUT_SENSES_MAINCLK);
#endif

    EnableGlobalIRQ(irqMask);
    __ISB();

    /* Re-enable clock for modules. */
    CLOCK_EnableClock(kCLOCK_Syscon1);
    CLOCK_EnableClock(kCLOCK_Iopctl1);
    CLOCK_EnableFroClkOutput(FRO2, kCLOCK_FroDiv1OutEn | kCLOCK_FroDiv3OutEn | kCLOCK_FroDiv6OutEn);
#if (DEMO_POWER_HIFI1_USED == 0U) || (DEMO_POWER_HIFI1_PRINT_ENABLE == 0U)
    CLOCK_AttachClk(kFRO2_DIV3_to_SENSE_BASE);
#endif
    CLOCK_EnableClock(kCLOCK_Mu1);
    CLOCK_EnableClock(kCLOCK_Syscon3);
    CLOCK_EnableClock(kCLOCK_Sema420);
    CLOCK_EnableClock(kCLOCK_LPI2c15);
#if (DEMO_POWER_HIFI1_USED == 0U) || (DEMO_POWER_HIFI1_PRINT_ENABLE == 0U)
    BOARD_InitDebugConsole();
#endif
}

/*! @brief Decrease the CPU frequency and supply voltage for lower power consumption.
 */
static inline void BOARD_PrepareForDS(void)
{
    /* Change to a lower frequency to safely decrease the VDD1 voltage when CPU1 enter low power mode but CPU0 is active
     * and still requires sense shared main clock. */
    CLOCK_AttachClk(kLPOSC_to_SENSE_BASE);
    CLOCK_AttachClk(kSENSE_BASE_to_SENSE_MAIN);
    CLOCK_EnableFroClkOutput(FRO2, kCLOCK_FroDiv6OutEn); /* Need Keep DIV6. */
#if defined(DEMO_POWER_SUPPLY_OPTION) && (DEMO_POWER_SUPPLY_OPTION == DEMO_POWER_SUPPLY_PMIC)
    BOARD_SetPmicVdd1Voltage(DEMO_LOW_POWER_RUN_VOLT);
#endif
#if (defined(BOARD_PMIC_CONFIG_USE_SEMA4) && (BOARD_PMIC_CONFIG_USE_SEMA4 != 0U))
    CLOCK_DisableClock(kCLOCK_Sema420);
#endif
    CLOCK_DisableClock(kCLOCK_LPI2c15);
}

/*! @brief Decrease the CPU frequency and supply voltage for lower power consumption.
 */
static inline void BOARD_RestoreAfterDS(void)
{
#if (defined(BOARD_PMIC_CONFIG_USE_SEMA4) && (BOARD_PMIC_CONFIG_USE_SEMA4 != 0U))
    CLOCK_EnableClock(kCLOCK_Sema420);
#endif
    CLOCK_EnableClock(kCLOCK_LPI2c15);
#if defined(DEMO_POWER_SUPPLY_OPTION) && (DEMO_POWER_SUPPLY_OPTION == DEMO_POWER_SUPPLY_PMIC)
    BOARD_SetPmicVdd1Voltage(DEMO_NORMAL_RUN_VOLT);
#endif
    CLOCK_EnableFroClkOutput(FRO2, kCLOCK_FroDiv1OutEn | kCLOCK_FroDiv3OutEn | kCLOCK_FroDiv6OutEn);
    CLOCK_AttachClk(kFRO2_DIV1_to_SENSE_MAIN);
    CLOCK_AttachClk(kFRO2_DIV3_to_SENSE_BASE);
}

void BOARD_EnterDeepSleep(const uint32_t exclude_from_pd[7])
{
    BOARD_StopDSP();
    BOARD_PrepareForDS();
    POWER_EnterDeepSleep(exclude_from_pd);
    BOARD_RestoreAfterDS();
    BOARD_ResumeDSP();
}

void BOARD_RequestDSR(const uint32_t exclude_from_pd[7])
{
    BOARD_StopDSP();
    BOARD_PrepareForDS();
    POWER_RequestDSR(exclude_from_pd);
    BOARD_RestoreAfterDS();
    BOARD_ResumeDSP();
}

void BOARD_RequestDPD(const uint32_t exclude_from_pd[7])
{
    /* Need keep sense shared main clock in case CPU0 enters power down mode after CPU1. */
    CLOCK_AttachClk(kLPOSC_to_SENSE_BASE);
    CLOCK_AttachClk(kSENSE_BASE_to_SENSE_MAIN);
    POWER_RequestDeepPowerDown(exclude_from_pd);
}

void BOARD_RequestFDPD(const uint32_t exclude_from_pd[7])
{
    CLOCK_AttachClk(kLPOSC_to_SENSE_BASE);
    CLOCK_AttachClk(kSENSE_BASE_to_SENSE_MAIN);
    POWER_RequestFullDeepPowerDown(exclude_from_pd);
}
void APP_SW_IRQ_HANDLER(void)
{
    POWER_ModuleExitLPRequest(APP_SW_LP_REQ); /* Clear the low power request before accessing the GPIO. */
    GPIO_GpioClearInterruptFlags(APP_USER_WAKEUP_KEY_GPIO, 1U << APP_USER_WAKEUP_KEY_PIN);
    DisableDeepSleepIRQ(APP_SW_IRQN);

    CLOCK_DisableClock(APP_SW_CLOCK_EN);
}

void APP_RTC_IRQ_HANDLER(void)
{
    uint32_t flags = IRTC_GetStatusFlags(APP_RTC);
    if ((flags & kIRTC_AlarmFlag) != 0U)
    {
        /* Unlock to allow register write operation */
        IRTC_SetWriteProtection(APP_RTC, false);
        /*Clear all irtc flag */
        IRTC_ClearStatusFlags(APP_RTC, flags);
    }

    DisableDeepSleepIRQ(APP_RTC_IRQN);
}

/*
 * Get user selection from UART.
 */
static uint32_t APP_GetUserSelection(void)
{
    uint32_t ch;

    /* Clear rx overflow error once it happens during low power mode. */
    if (APP_USART_RX_ERROR == (APP_USART_RX_ERROR & LPUART_GetStatusFlags((LPUART_Type *)BOARD_DEBUG_UART_BASEADDR)))
    {
        LPUART_ClearStatusFlags((LPUART_Type *)BOARD_DEBUG_UART_BASEADDR, APP_USART_RX_ERROR);
    }

    DEMO_LOG(
        "Select an option\r\n"
        "\t1. Sleep mode\r\n"
        "\t2. Deep Sleep mode\r\n"
        "\t3. Deep Sleep Retention mode\r\n"
        "\t4. Deep power down mode\r\n"
        "\t5. Full deep power down mode\r\n"
        "\t6. Active test mode\r\n");
    while (1)
    {
        ch = GETCHAR();
        if ((ch < '1') || (ch > '6'))
        {
            continue;
        }
        else
        {
            ch = ch - '1';
            break;
        }
    }
    switch (ch)
    {
        case 0:
            ch = kPower_Sleep;
            break;
        case 1:
            ch = kPower_DeepSleep;
            break;
        case 2:
            ch = kPower_DeepSleepRetention;
            break;
        case 3:
            ch = kPower_DeepPowerDown;
            break;
        case 4:
            ch = kPower_FullDeepPowerDown;
            break;
        default:
            break;
    }
    return ch;
}

/* Get wakeup source by user input. */
static app_wakeup_source_t APP_GetWakeupSource(uint32_t mode)
{
    uint8_t ch;

    while (true)
    {
        DEMO_LOG("Select the wake up source:\r\n");
        if ((mode != kPower_DeepPowerDown) && (mode != kPower_FullDeepPowerDown))
        {
            DEMO_LOG("Press T for RTC.\r\n");
            if (mode != kPower_DeepSleepRetention)
            {
                DEMO_LOG("Press S for wakeup pin(%s).\r\n", APP_USER_WAKEUP_KEY_NAME);
            }
            DEMO_LOG("Press N for Reset.\r\n");
            DEMO_LOG("\r\nWaiting for key press..\r\n\r\n");
            ch = GETCHAR();
            DEMO_LOG("%c\r\n", ch);

            if ((ch >= 'a') && (ch <= 'z'))
            {
                ch -= 'a' - 'A';
            }

            if (ch == 'T')
            {
                return kAPP_WakeupSourceRtc;
            }
            else if ((ch == 'S') && (mode != kPower_DeepSleepRetention))
            {
                return kAPP_WakeupSourcePin;
            }
            else if (ch == 'N')
            {
                return kAPP_WakeupSourceReset;
            }
            else
            {
                DEMO_LOG("Wrong value!\r\n");
            }
        }
        else
        {
            DEMO_LOG("Reset to wakeup.\r\n");
            return kAPP_WakeupSourceReset;
        }
    }
}

/*!
 * @brief Get input from user about wakeup timeout
 */
static uint8_t APP_GetWakeupTimeout(void)
{
    uint8_t timeout;

    while (1)
    {
        DEMO_LOG("Select the wake up timeout in seconds.\r\n");
        DEMO_LOG("The allowed range is 1s ~ 9s.\r\n");
        DEMO_LOG("Eg. enter 5 to wake up in 5 seconds.\r\n");
        DEMO_LOG("\r\nWaiting for input timeout value...\r\n\r\n");

        timeout = GETCHAR();
        DEMO_LOG("%c\r\n", timeout);
        if ((timeout > '0') && (timeout <= '9'))
        {
            return timeout - '0';
        }
        DEMO_LOG("Wrong value!\r\n");
    }
}

void APP_GetWakeupConfig(uint32_t targetMode)
{
    /* Get wakeup source by user input. */
    s_wakeupSource = APP_GetWakeupSource(targetMode);

