nxp-mcuxpresso/mcux-sdk-examples/mimxrt700evk/demo_apps/power_mode_with_hifi/cm33_core1/power_mode_with_hifi.c
    if (kAPP_WakeupSourceRtc == s_wakeupSource)
    {
        /* Wakeup source is Timer, user should input wakeup timeout value. */
        s_wakeupTimeout = APP_GetWakeupTimeout();
    }
    else
    {
        s_wakeupTimeout = 0U;
    }
}

/*
 * Setup a GPIO input pin as wakeup source.
 */
static void APP_InitWakeupPin(void)
{
    gpio_pin_config_t gpioPinConfigStruct;

    /* Set SW pin as GPIO input. */
    gpioPinConfigStruct.pinDirection = kGPIO_DigitalInput;
    gpioPinConfigStruct.outputLogic  = 0U;

    RESET_ClearPeripheralReset(APP_SW_RESET_RSTn);
    CLOCK_EnableClock(APP_SW_CLOCK_EN);

    GPIO_SetPinInterruptConfig(APP_USER_WAKEUP_KEY_GPIO, APP_USER_WAKEUP_KEY_PIN, kGPIO_InterruptFallingEdge);
    GPIO_PinInit(APP_USER_WAKEUP_KEY_GPIO, APP_USER_WAKEUP_KEY_PIN, &gpioPinConfigStruct);
}

static void APP_InitWakeupTimer(void)
{
    irtc_config_t irtcConfig;

    IRTC_GetDefaultConfig(&irtcConfig);
    if (IRTC_Init(APP_RTC, &irtcConfig) != kStatus_Success)
    {
        DEMO_LOG("RTC Init Failed.\r\n");
    }
}

static void APP_SetWakeupConfig(void)
{
    irtc_datetime_t datetime;

    if (s_wakeupSource == kAPP_WakeupSourceRtc)
    {
        /* Read the RTC seconds register to get current time in seconds */
        IRTC_GetDatetime(APP_RTC, &datetime);
        /* Add alarm seconds to current time */
        datetime.second += s_wakeupTimeout;
        if (datetime.second > 59U)
        {
            datetime.minute++;
            datetime.second -= 60U;
        }
        /* Unlock to allow register write operation */
        IRTC_SetWriteProtection(APP_RTC, false);
        /* Set alarm time in seconds */
        IRTC_SetAlarm(APP_RTC, &datetime);
        /* Enable RTC alarm interrupt */
        IRTC_EnableInterrupts(APP_RTC, kIRTC_AlarmInterruptEnable);
        EnableDeepSleepIRQ(APP_RTC_IRQN);
        DEMO_LOG("RTC wake up after %d seconds.\r\n", s_wakeupTimeout);
    }
    else if (s_wakeupSource == kAPP_WakeupSourcePin)
    {
        APP_InitWakeupPin();
        EnableDeepSleepIRQ(APP_SW_IRQN);
        /* Low power handshake to for async interrupt. */
        if (POWER_ModuleEnterLPRequest(APP_SW_LP_REQ) != kStatus_Success)
        {
            assert(false);
        }
        DEMO_LOG("Push wakeup PIN to wake up.\r\n");
    }
    else
    {
    }
}

/*!
 * @brief Main function
 */
int main(void)
{
    uint32_t freq = 0U;

    /* Init board hardware. */
    uint32_t i;
    BOARD_DisableIoPads();
    POWER_DisablePD(kPDRUNCFG_PD_FRO2); /* Sense uses FRO2. */
    BOARD_InitPins();
    BOARD_BootClockRUN();

    BOARD_InitDebugConsole();

    BOARD_InitPowerConfig();
    /* Dummy read the SRAM partition to let SRAM partition's clock park on Sense domain,
    incase the it was on CPU0's RAM1 clock and the clock is disabled after CPU1 boot. */
    for (i = DEMO_HIFI1_SRAM_PT_START; i <= DEMO_HIFI1_SRAM_PT_END; i++)
    {
        POWER_SramDummyRead(i);
    }
    BOARD_DSP_Init(1U, 2U, true); /* Select FRO2_MAX divider by 2 as HIFI clock. */

    BOARD_NotifyBoot();           /* Set boot flag. */

    /* Determine the power mode before bring up. */
    if ((POWER_GetEventFlags() & PMC_FLAGS_DEEPPDF_MASK) != 0)
    {
        DEMO_LOG("Board wake up from deep or full deep power down mode.\r\n");
        POWER_ClearEventFlags(PMC_FLAGS_DEEPPDF_MASK);
    }
    POWER_ClearEventFlags(0xFFFFFFFF);

    APP_InitWakeupTimer();

    while (1)
    {
        freq = CLOCK_GetCoreSysClkFreq();

        DEMO_LOG("\r\n####################  Power Mode Switch - %s ####################\n\r\n", APP_CORE_NAME);
        DEMO_LOG("    Build Time: %s--%s \r\n", __DATE__, __TIME__);
        DEMO_LOG("    Core Clock: %dHz \r\n", freq);

        gCurrentPowerMode = APP_GetUserSelection();

        if (gCurrentPowerMode == 5U)
        {
            BOARD_RunActiveTest();
            continue;
        }

        APP_GetWakeupConfig(gCurrentPowerMode);
        APP_SetWakeupConfig();

        DEMO_LOG("Entering %s ...\r\n", gWakeupInfoStr[gCurrentPowerMode]);
        /* Enter the low power mode. */
        switch (gCurrentPowerMode)
        {
            case kPower_Sleep: /* Enter sleep mode. */
                BOARD_EnterSleep();
                break;
            case kPower_DeepSleep: /* Enter deep sleep mode. */
                BOARD_EnterDeepSleep(APP_EXCLUDE_FROM_DEEPSLEEP);
                break;
            case kPower_DeepSleepRetention:
                BOARD_RequestDSR(APP_EXCLUDE_FROM_DSR);
                BOARD_RestorePeripheralsAfterDSR(); /* Restore the peripherals whose states are not retained in DSR. */
                break;
            case kPower_DeepPowerDown: /* Request deep power down(DPD) mode. The SOC enters DPD only when both domains
                                          requested DPD mode. */
                DEMO_LOG(
                    "The chip enters DPD only when both domains request entering DPD mode. Wakeup the device by "
                    "reset\r\n\r\n");
#if (DEMO_POWER_SUPPLY_OPTION == DEMO_POWER_SUPPLY_PMIC)
                BOARD_SetPmicVoltageBeforeDeepPowerDown();
#endif
                BOARD_RequestDPD(APP_EXCLUDE_FROM_DEEP_POWERDOWN);
                /* After deep power down wakeup, the code will restart and cannot reach here. */
                break;
            case kPower_FullDeepPowerDown: /* Request full deep power down(FDPD) mode. The SOC enters FDPD only when
                                              both domains requested FDPD mode. */
                DEMO_LOG(
                    "The chip enters FDPD only when both domains request entering FDPD mode. Wakeup the device by "
                    "reset\r\n\r\n");
#if (DEMO_POWER_SUPPLY_OPTION == DEMO_POWER_SUPPLY_PMIC)
                BOARD_SetPmicVoltageBeforeDeepPowerDown();
#endif
                BOARD_RequestFDPD(APP_EXCLUDE_FROM_FULL_DEEP_POWERDOWN);
                /* After full deep power down wakeup, the code will restart and cannot reach here. */
                break;
            default:
                break;
        }

        DEMO_LOG("Wakeup.\r\n");
    }
}
